In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)

1.0.3

In [3]:
seri = pd.Series([1, 20, 3, -12, 5], index=['a', 'b', 'c', 'd', 'e'])
seri

a     1
b    20
c     3
d   -12
e     5
dtype: int64

In [13]:
data = {
    'Name': ['XXX', 'YYY', 'ZZZ', 'QQQ'],
    'Exp': [1,3,5,4],
    'Salary': [1500,3000,6000,4200]
}

df = pd.DataFrame(data, columns=["Name", "Exp", "Salary"])
df
#print(data)

  Name  Exp  Salary
0  XXX    1    1500
1  YYY    3    3000
2  ZZZ    5    6000
3  QQQ    4    4200

In [28]:
# Definition of countries and capital
germany='germany'
countries = ['spain', 'france',germany , 'norway']
capitals = ['madrid', 'paris', 'berlin', 'oslo']

# Get index of 'germany': ind_ger
ind_ger=countries.index(germany)

# Use ind_ger to print out capital of Germany
print(capitals[ind_ger])

berlin

In [30]:
# Definition of countries and capital
countries = ['spain', 'france', 'germany', 'norway']
capitals = ['madrid', 'paris', 'berlin', 'oslo']

# From string in countries and capitals, create dictionary europe
europe = { 'spain':'madrid', 'france':'paris', 'germany':'berlin', 'norway':'oslo' }

# Print europe
print(europe)
print(europe.keys())
# Print out value that belongs to key 'norway'
print(europe['norway'])

{'spain': 'madrid', 'france': 'paris', 'germany': 'berlin', 'norway': 'oslo'}
dict_keys(['spain', 'france', 'germany', 'norway'])
oslo

In [42]:
#immutable objects
immutable_list={0:'hello',True:'dear',"two":"world"}
print(F"'One' exists in list: {'one' in immutable_list}")
print(F"'Two' exists in list: {'two' in immutable_list}")
del(immutable_list["two"])
print(F"'Two' exists in list: {'two' in immutable_list}")

'One' exists in list: False
'Two' exists in list: True
'Two' exists in list: False

In [43]:
#type error unhashable type: list
{["one","two","three"]:"value"}

TypeError: unhashable type: 'list'

In [ ]:
# dictionary: indexed by unique keys       : Collection of values order matters, select entire subsets
# list:     : indexed by range of numbers  : Lookup table with unique keys

In [44]:
# pandas    : high level data manipulation data, Dataframe, different columns with different types
dict={
    "country":["China","India","US","Indonesia","Pakistan"],
    "percent":["18.0","17.5","4.23","3.43","2.84"],
    "population":["1,394,015,977", "1,326,093,247","332,639,102","267,026,366","233,500,636"],
    "order":[1,2,3,4,5]
}

dict.index=["CH","EN","USA","IN","PA"]
dict
# big data import is better solution

AttributeError: 'dict' object has no attribute 'index'

In [45]:
names = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
dr =  [True, False, False, False, True, True, True]
cpc = [809, 731, 588, 18, 200, 70, 45]

my_dict={"country":names,
"drives_right":dr,
"cars_per_cap":cpc}

cars=pd.DataFrame(my_dict)
# Print cars
print(cars)

country  drives_right  cars_per_cap
0  United States          True           809
1      Australia         False           731
2          Japan         False           588
3          India         False            18
4         Russia          True           200
5        Morocco          True            70
6          Egypt          True            45

In [47]:
trains = pd.read_csv('./titanic_dataset/train.csv', index_col=0)
print(trains)

Survived  Pclass  \
PassengerId
1                   0       3
2                   1       1
3                   1       3
4                   1       1
5                   0       3
...               ...     ...
887                 0       2
888                 1       1
889                 0       3
890                 1       1
891                 0       3

                                                          Name     Sex   Age  \
PassengerId
1                                      Braund, Mr. Owen Harris    male  22.0
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
3                                       Heikkinen, Miss. Laina  female  26.0
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
5                                     Allen, Mr. William Henry    male  35.0
...                                                        ...     ...   ...
887                                      Montvila, Rev. Juozas    male  27.0
888                               Graham, Miss. Margaret Edith  female  19.0
889                   Johnston, Miss. Catherine Helen "Carrie"  female   NaN
890                                      Behr, Mr. Karl Howell    male  26.0
891                                        Dooley, Mr. Patrick    male  32.0

             SibSp  Parch            Ticket     Fare Cabin Embarked
PassengerId
1                1      0         A/5 21171   7.2500   NaN        S
2                1      0          PC 17599  71.2833   C85        C
3                0      0  STON/O2. 3101282   7.9250   NaN        S
4                1      0            113803  53.1000  C123        S
5                0      0            373450   8.0500   NaN        S
...            ...    ...               ...      ...   ...      ...
887              0      0            211536  13.0000   NaN        S
888              0      0            112053  30.0000   B42        S
889              1      2        W./C. 6607  23.4500   NaN        S
890              0      0            111369  30.0000  C148        C
891              0      0            370376   7.7500   NaN        Q

[891 rows x 11 columns]

In [82]:
#Column-access
trains[["Ticket","Name"]] #.loc[[ x for x in range(850,890)]]
#row-access
trains[850:890] 
#loc label-based
#row-access
trains.loc[[ x for x in range(850,890)]]
#column -access
trains.loc[:,["Ticket","Name"]]
#Row & Column 
trains.loc[[x for x in range(850,860)],["Ticket","Name"]]
# Row&column iloc -> integer position-based
trains.iloc[:,[7,2]]
# single bracket version gives a Pandas Series, the double bracket version gives a Pandas DataFrame.

,Ticket,Name
PassengerId,,
1,A/5 21171,"Braund, Mr. Owen Harris"
2,PC 17599,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
3,STON/O2. 3101282,"Heikkinen, Miss. Laina"
4,113803,"Futrelle, Mrs. Jacques Heath (Lily May Peel)"
5,373450,"Allen, Mr. William Henry"
...,...,...
887,211536,"Montvila, Rev. Juozas"
888,112053,"Graham, Miss. Margaret Edith"
889,W./C. 6607,"Johnston, Miss. Catherine Helen ""Carrie"""
890,111369,"Behr, Mr. Karl Howell"
891,370376,"Dooley, Mr. Patrick"